app/controllers/patients_controller.rb

  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("patientId", "fullName", "address", "birthDate") VALUES (?, ?, ?, ?)  [["patientId", "036892628"], ["fullName", "Moti Monsonego"], ["address", "Jerusalem"], ["birthDate", "2015-03-01 00:00:00.000000"]]

    def set_patient
      @patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]