app/controllers/reports_controller.rb

SELECT "reports".* FROM "reports"
---
  def index
    @reports = Report.all

SELECT "patients".* FROM "patients"
SELECT "users".* FROM "users"
---
  def new
    @report = Report.new
    @patients = Patient.all
    @users = User.all

SELECT "patients".* FROM "patients"
SELECT "users".* FROM "users"
INSERT INTO "reports" ("background", "description", "conclusion", "date", "nextDate") VALUES (?, ?, ?, ?, ?)  [["background", "Naim Is From Iraq"], ["description", "Naim Drink Tea"], ["conclusion", "Naim Is Crazy"], ["date", "2015-03-01 00:00:00.000000"], ["nextDate", "2015-09-01 00:00:00.000000"]]
---
  def create
    @patients = Patient.all
    @users = User.all
    @report = Report.new(report_params)

    respond_to do |format|
      if @report.save

SELECT  "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_report
      @report = Report.find(params[:id])