app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."userName" = ? LIMIT 1  [["userName", "admin"]]
---
  def create
    user = User.find_by_userName(params[:userName])